# LckObjs

## Description
Procedure LckObjs locks the selected objects. When an object is locked, it&lt;BR&gt;
may be copied or duplicated, but it may not be changed in any other way.&lt;BR&gt;
&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE LckObjs;
```

```python

def vs.LckObjs():
    return None
```

## Examples
```pascal
SelectObj((C='Structure To Remain'));

LckObjs;
```

## Version
Availability: from MiniCAD
## Category
* General Edit